Project Path: arc_gmh5225_Ark-tools_35sldogl

Source Tree:

```txt
arc_gmh5225_Ark-tools_35sldogl
├── DpcTimer_x64
│   ├── DpcTimer
│   │   ├── DpcTimer
│   │   │   ├── DpcTimer.aps
│   │   │   ├── DpcTimer.cpp
│   │   │   ├── DpcTimer.h
│   │   │   ├── DpcTimer.rc
│   │   │   ├── DpcTimer.vcxproj
│   │   │   ├── DpcTimer.vcxproj.filters
│   │   │   ├── DpcTimer.vcxproj.user
│   │   │   ├── DpcTimerDlg.cpp
│   │   │   ├── DpcTimerDlg.h
│   │   │   ├── ReadMe.txt
│   │   │   ├── res
│   │   │   │   ├── DpcTimer.ico
│   │   │   │   └── DpcTimer.rc2
│   │   │   ├── resource.h
│   │   │   ├── stdafx.cpp
│   │   │   ├── stdafx.h
│   │   │   └── targetver.h
│   │   ├── DpcTimer.sln
│   │   └── DpcTimer.suo
│   ├── DpcTimer.PNG
│   ├── DpcTimerDrv
│   │   ├── DpcTimerDrv.c
│   │   ├── DpcTimerDrv.h
│   │   ├── DpcTimerDrv.sln
│   │   ├── DpcTimerDrv.suo
│   │   ├── DpcTimerDrv.vcxproj
│   │   ├── DpcTimerDrv.vcxproj.user
│   │   ├── clean.bat
│   │   ├── ddkbuild.cmd
│   │   ├── makefile
│   │   ├── mybuild.bat
│   │   └── sources
│   ├── PCHunter64.PNG
│   └── bin
│       ├── DpcTimer.exe
│       └── DpcTimerDrv.sys
├── DrxHook
│   ├── DrxHook
│   │   ├── DrxHook.c
│   │   ├── DrxHook.h
│   │   ├── DrxHook.sln
│   │   ├── DrxHook.suo
│   │   ├── DrxHook.vcxproj
│   │   ├── DrxHook.vcxproj.user
│   │   ├── clean.bat
│   │   ├── ddkbuild.cmd
│   │   ├── makefile
│   │   ├── mybuild.bat
│   │   └── sources
│   └── README.md
├── HideIDTHook
│   ├── HideIDTHook

			804e3649 83c001          add     eax,1
			804e364c 7306            jae     nt!KeUpdateSystemTime+0x7c (804e3654)
			804e364e ff059c005680    inc     dword ptr [nt!ExpTickCountAdjustmentCount (8056009c)]
			804e3654 a198005680      mov     eax,dword ptr [nt!ExpTickCountAdjustment (80560098)]
			804e3659 0faf059c005680  imul    eax,dword ptr [nt!ExpTickCountAdjustmentCount (8056009c)]
			804e3660 03c1            add     eax,ecx
			804e3662 a30000dfff      mov     dword ptr ds:[FFDF0000h],eax
			804e3667 58              pop     eax
			804e3668 25ff000000      and     eax,0FFh
			804e366d 8d0cc5a0355680  lea     ecx,nt!KiTimerTableListHead (805635a0)[eax*8]

			*/

			Temp = *(PCHAR)Start;
			if (Temp == 0x8d)
			{
				KiTimerTableListHead = *(PULONG)(Start + 3);
				if (KiTimerTableListHead && MmIsAddressValid((PVOID)KiTimerTableListHead))
				{
					break;
				}
			}
		}
	}

	return KiTimerTableListHead;
}



NTSTATUS GetDpcTimerInformationWinXP(PLIST_ENTRY KiTimerTableListHead, PDPC_TIMER_INFOR DpcTimerInfor)
{
	NTSTATUS Status = STATUS_UNSUCCESSFUL;
	ULONG TIMER_TABLE_SIZE = 0x100;     //查看Wrk代码是0x200 但 写成0x200 会蓝屏



	if (KiTimerTableListHead &&
		DpcTimerInfor &&
		TIMER_TABLE_SIZE && 
		MmIsAddressValid((PVOID)KiTimerTableListHead))
	{
		ULONG i = 0, n = 0;
		KIRQL OldIrql = KeRaiseIrqlToDpcLevel();

		for (i = 0; i < TIMER_TABLE_SIZE; i++)
		{
			PLIST_ENTRY NextEntry = (&KiTimerTableListHead[i])->Flink;

			while (MmIsAddressValid(NextEntry) && &KiTimerTableListHead[i] != NextEntry)
			{
				PKTIMER Timer = CONTAINING_RECORD(NextEntry, KTIMER, TimerListEntry);

				if (Timer && 
					MmIsAddressValid(Timer) &&
					MmIsAddressValid(Timer->Dpc) &&
					MmIsAddressValid(Timer->Dpc->DeferredRoutine))
				{
					if (DpcTimerInfor->ulCnt > DpcTimerInfor->ulRetCnt)
					{
						PKDPC Dpc = Timer->Dpc;
						PVOID TimerDispatch = Dpc->DeferredRoutine;


						DpcTimerInfor->DpcTimer[n].Dpc = (ULONG)Dpc;
						DpcTimerInfor->DpcTimer[n].Period = Timer->Period;
						DpcTimerInfor->DpcTimer[n].TimeDispatch = (ULONG)TimerDispatch;
						DpcTimerInfor->DpcTimer[n].TimerObject = (ULONG)Timer;

						n++;
					}

					DpcTimerInfor->ulRetCnt++;
				}

				NextEntry = NextEntry->Flink;
			}
		}

		KeLowerIrql(OldIrql);
	}

	return Status;
}



NTSTATUS GetDpcTimerInformationWin7(PDPC_TIMER_INFOR DpcTimerInfor)
{
	ULONG CPUNumber = KeNumberProcessors;   //系统变量
	PUCHAR CurrentKPRCBAddress = NULL;             //CPU控制块
	PUCHAR CurrentTimerTableEntry = NULL;
	PLIST_ENTRY CurrentEntry = NULL;
	PLIST_ENTRY NextEntry = NULL;
	PULONG64    KiWaitAlways = NULL;
	PULONG64    KiWaitNever  = NULL;
	int i = 0;
	int j = 0;
	int n = 0;
	PKTIMER Timer;
	for(j=0; j<CPUNumber; j++)
	{
		KeSetSystemAffinityThread(j+1);   //使当前线程运行在第一个处理器上，因为只有第一个处理器的值才有效
		CurrentKPRCBAddress=(PUCHAR)__readmsr(0xC0000101) + 0x20;
		KeRevertToUserAffinityThread();   ////恢复线程运行的处理器
	
		CurrentTimerTableEntry=(PUCHAR)(*(ULONG64*)CurrentKPRCBAddress + 0x2200 + 0x200);
		/*
		kd> dt _Kprcb
		nt!_KPRCB
		+0x000 MxCsr            : Uint4B
		+0x004 LegacyNumber     : UChar
		+0x005 ReservedMustBeZero : UChar
		+0x006 InterruptRequest : UChar
		+0x21ec UnusedPad        : Uint4B
		+0x21f0 PrcbPad50        : [2] Uint8B
		+0x2200 TimerTable       : _KTIMER_TABLE


		kd> dt _KTIMER_TABLE
		nt!_KTIMER_TABLE
		+0x000 TimerExpiry      : [64] Ptr64 _KTIMER
		+0x200 TimerEntries     : [256] _KTIMER_TABLE_ENTRY


		kd> dt _KTIMER_TABLE_ENTRY
		nt!_KTIMER_TABLE_ENTRY
		+0x000 Lock             : Uint8B
		+0x008 Entry            : _LIST_ENTRY
		+0x018 Time             : _ULARGE_INTEGER
		*/

	
		FindKiWaitFunc(&KiWaitNever,&KiWaitAlways);
		for(i=0; i<0x100; i++)
		{
			typedef struct _KTIMER_TABLE_ENTRY
			{
				ULONG64			Lock;
				LIST_ENTRY		Entry;
				ULARGE_INTEGER	Time;
			} KTIMER_TABLE_ENTRY, *PKTIMER_TABLE_ENTRY;
			CurrentEntry = (PLIST_ENTRY)(CurrentTimerTableEntry + sizeof(KTIMER_TABLE_ENTRY) * i + 8);  //这里是个数组  + 8 过Lock
			NextEntry = CurrentEntry->Blink;
			if( MmIsAddressValid(CurrentEntry) && MmIsAddressValid(CurrentEntry) )
			{
				while( NextEntry != CurrentEntry )
				{
					PKDPC RealDpc;

					//获得首地址
					Timer = CONTAINING_RECORD(NextEntry,KTIMER,TimerListEntry);
					/*
					kd> dt _KTIMER
					nt!_KTIMER
					+0x000 Header           : _DISPATCHER_HEADER
					+0x018 DueTime          : _ULARGE_INTEGER
					+0x020 TimerListEntry   : _LIST_ENTRY
					+0x030 Dpc              : Ptr64 _KDPC
					+0x038 Processor        : Uint4B
					+0x03c Period           : Uint4B
					*/
					RealDpc=TransTimerDpcEx(Timer,*KiWaitNever,*KiWaitAlways);
					if( MmIsAddressValid(Timer)&&MmIsAddressValid(RealDpc)&&MmIsAddressValid(RealDpc->DeferredRoutine))
					{
				
						if (DpcTimerInfor->ulCnt > DpcTimerInfor->ulRetCnt)
						{
							DpcTimerInfor->DpcTimer[n].Dpc = (ULONG64)RealDpc;
							DpcTimerInfor->DpcTimer[n].Period = Timer->Period;
							DpcTimerInfor->DpcTimer[n].TimeDispatch = (ULONG64)RealDpc->DeferredRoutine;
							DpcTimerInfor->DpcTimer[n].TimerObject = (ULONG64)Timer;

							n++;
						}
					
						DpcTimerInfor->ulRetCnt++;
					
					}
					NextEntry = NextEntry->Blink;
				}
			}
		}
	}
}



VOID FindKiWaitFunc(PULONG64 *KiWaitNeverAddr, PULONG64 *KiWaitAlwaysAddr)
{
	/*
	kd> u kesettimer l 50
	nt!KeSetTimer:
	fffff800`03ef10a8 4883ec38        sub     rsp,38h
	fffff800`03ef10ac 4c89442420      mov     qword ptr [rsp+20h],r8
	fffff800`03ef10b1 4533c9          xor     r9d,r9d
