Project Path: arc_gmh5225_pt-detector_uryeunwr

Source Tree:

```txt
arc_gmh5225_pt-detector_uryeunwr
├── LICENSE
├── Projects
│   ├── PtExploitDetector
│   │   ├── EntryPoint.cpp
│   │   ├── IntelPt.h
│   │   ├── PtExploitDetector.cpp
│   │   ├── PtExploitDetector.h
│   │   ├── PtExploitDetector.rc
│   │   ├── PtExploitDetector.sln
│   │   ├── PtExploitDetector.vcxproj
│   │   ├── PtExploitDetector.vcxproj.filters
│   │   ├── UndocNt.h
│   │   ├── decoder
│   │   │   ├── basic_include
│   │   │   │   ├── inttypes.h
│   │   │   │   └── threads.h
│   │   │   ├── intel-pt.h
│   │   │   ├── libipt.lib
│   │   │   ├── libipt.txt
│   │   │   ├── pt_cpu.cpp
│   │   │   ├── pt_cpu.h
│   │   │   ├── pt_cpuid.cpp
│   │   │   ├── pt_cpuid.h
│   │   │   ├── pt_last_ip.cpp
│   │   │   ├── pt_last_ip.h
│   │   │   ├── pt_time.cpp
│   │   │   ├── pt_time.h
│   │   │   └── ptdump.cpp
│   │   ├── pt_dump.h
│   │   ├── res
│   │   │   ├── icon.ico
│   │   │   ├── icon.png
│   │   │   └── libipt.dll
│   │   ├── resource.h
│   │   ├── stdafx.cpp
│   │   ├── stdafx.h
│   │   └── targetver.h
│   ├── PtExploitDetectorAgent
│   │   ├── Executors
│   │   │   ├── executors.h
│   │   │   └── get_remote_function_address.cpp
│   │   ├── PtExploitDetectorAgent.vcxproj
│   │   ├── PtExploitDetectorAgent.vcxproj.filters
│   │   ├── ReadMe.txt
│   │   ├── dispatcher.cpp
│   │   ├── dispatcher.h
│   │   ├── dllmain.cpp
│   │   ├── helpers.cpp
│   │   └── helpers.h
│   ├── PtExploitDetectorGUI

            }
            FreePacket(packet);
        }
        return ret;
    }
}
```

`Projects/common/ipcpp.h`:

```h
#ifndef _DIPC_H_
#define _DIPC_H_

#include <vector>

#include "ipc.h"

namespace dipc
{
    class mutex
    {
    private:
        volatile LONG interlock_;
    public:
        mutex();
        ~mutex();
    private:
        void lock();
        void unlock();
        friend class locker;
    };

    class locker
    {
        mutex&    m_;
    public:
        locker(mutex& m);
        ~locker();
    };

    typedef int (*pf_handler)(unsigned char* data);

#ifdef _UNICODE
#define  tstring    wstring
#else
#define  tstring    string
#endif

    class server {
        struct router {
            int cmd;
            pf_handler handler;
        };
        typedef IpcServer server_data;

    public:
        server(const std::tstring& name = std::tstring(), int timeout = 1000);
        ~server();
        void run();
        void stop();
        void route(int cmd, pf_handler handler);

    private:
        bool stop_;
        mutex mr_;
        std::vector<router> routers_;
        struct server_data* data_;
    };

    typedef std::vector<unsigned char> byte_array;

    class client {
    public:
        client(const std::tstring& server_name = std::tstring(), int timeout = 1000);
        ~client();

        byte_array request(int cmd, unsigned char* data = NULL, int data_size = 0);
    private:
        std::tstring server_name;
        int timeout;
    };
}

#endif
```

`README.md`:

```md
# Computer Engineering - Thesis Project

**Title**: “Code-Reuse Exploits detection using the Intel Processor Trace technology”

**Description**: This project pretends, making use of the IntelPT technology, develop a mechanism to detect different kinds of Code-Reuse exploits (ie: ret2libc, ROP, JOP, etc.) at runtime, based on the Control Flow Integrity mitigation (aka. CFI).

**Credits**: This project make use of the following projects:
* [WindowsIntelPT Driver](https://github.com/intelpt/WindowsIntelPT)
* [Libipt - Intel(R) Processor Trace decoder library](https://github.com/01org/processor-trace)
* [Keystone assembler framework](https://github.com/keystone-engine/keystone)
* [RapidJSON](https://github.com/Tencent/rapidjson)
* [DIPC](https://github.com/breezechen/dipc)
* [Plog](https://github.com/SergiusTheBest/plog)

```

`Resources/Compiled_IntelPt/INSTDRV_init_V01.bat`:

```bat
INSTDRV.EXE V01\WindowsPtDriver.sys
```

`Resources/Compiled_IntelPt/INSTDRV_init_V02.bat`:

```bat
INSTDRV.EXE V02\WindowsPtDriver.sys
```

`Resources/Compiled_IntelPt/V01/Readme.md`:

```md
Init version. This version is the version contained in the original fork.
```

`Resources/Compiled_IntelPt/V02/Readme.md`:

```md
This version implements a fix to suport the Spectre&Meltdown windows patch.
The path includes a new mechanism to work with the directory table. Now there are two
base addresses, one is the DirectoryTableBase and the other the UserDirectoryTableBase.

nt!_KPROCESS
+0x000 Header : _DISPATCHER_HEADER
+0x018 ProfileListHead : _LIST_ENTRY
+0x028 DirectoryTableBase : Uint8B
+0x030 ThreadListHead : _LIST_ENTRY
+0x040 ProcessLock : Uint4B
+0x044 ProcessTimerDelay : Uint4B
+0x048 DeepFreezeStartTime : Uint8B
+0x050 Affinity : _KAFFINITY_EX
+0x0f8 ReadyListHead : _LIST_ENTRY
+0x108 SwapListEntry : _SINGLE_LIST_ENTRY
+0x110 ActiveProcessors : _KAFFINITY_EX
+0x1b8 AutoAlignment : Pos 0, 1 Bit
+0x1b8 DisableBoost : Pos 1, 1 Bit
+0x1b8 DisableQuantum : Pos 2, 1 Bit
+0x1b8 DeepFreeze : Pos 3, 1 Bit
+0x1b8 TimerVirtualization : Pos 4, 1 Bit
+0x1b8 CheckStackExtents : Pos 5, 1 Bit
+0x1b8 PpmPolicy : Pos 6, 3 Bits
+0x1b8 ActiveGroupsMask : Pos 9, 20 Bits
+0x1b8 ReservedFlags : Pos 29, 3 Bits
+0x1b8 ProcessFlags : Int4B
+0x1bc BasePriority : Char
+0x1bd QuantumReset : Char
+0x1be Visited : UChar
+0x1bf Flags : _KEXECUTE_OPTIONS
+0x1c0 ThreadSeed : [20] Uint4B
+0x210 IdealNode : [20] Uint2B
+0x238 IdealGlobalNode : Uint2B
+0x23a Spare1 : Uint2B
+0x23c StackCount : _KSTACK_COUNT
+0x240 ProcessListEntry : _LIST_ENTRY
+0x250 CycleTime : Uint8B
+0x258 ContextSwitches : Uint8B
+0x260 SchedulingGroup : Ptr64 _KSCHEDULING_GROUP
+0x268 FreezeCount : Uint4B
+0x26c KernelTime : Uint4B
+0x270 UserTime : Uint4B
+0x274 ReadyTime : Uint4B
+0x278 UserDirectoryTableBase : Uint8B
+0x280 AddressPolicy : UChar
+0x281 Spare2 : [71] UChar
+0x2c8 InstrumentationCallback : Ptr64 Void
+0x2d0 SecureState :
```

`Resources/Compiled_IntelPt/readme.md`:

```md
<h2>Compiled Windows Intel PT Driver</h2>

<p>This folder contains the compiled version of the Windows Intel PT Driver and Control Application</p>
<p>Version: 0.6</p>
<p>News:
<ul>
   <li>Re-designed the entire driver code. Now it is much more modular and scalable</li>
   <li>Added and tested the support for Kernel-mode tracing</li>
   <li>Added the support for Kernel tracing from the user-mode application (requires Administratives privilege)</li>
   <li>Added the support for Microsoft HyperV (Root Partition only)</li>
   <li>Written some example code for doing Kernel-tracing of the loading/unloading code of a target driver</li>
</ul></p>
<p>Unfortunately the driver code is still too young to be compiled as signed. 
You need to enable the Test Signing mode in your Windows OS to be able to use the driver.
